apache/nuttx/arch/arm/src/common/stm32/stm32_allocateheap_m3m4_v1.c
/****************************************************************************
 * arch/arm/src/common/stm32/stm32_allocateheap_m3m4_v1.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <string.h>
#include <assert.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/board.h>
#include <nuttx/kmalloc.h>
#include <nuttx/userspace.h>

#include <arch/board/board.h>

#include "chip.h"

#include "mpu.h"
#include "arm_internal.h"
#include "stm32_mpuinit.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Internal SRAM is available in all members of the STM32 family. The
 * following definitions must be provided to specify the size and
 * location of internal(system) SRAM:
 *
 * CONFIG_RAM_END             : End address (+1) of SRAM (F1 family only, the
 *                            : F4 family uses the a priori end of SRAM)
 *
 * The F4 family also contains internal CCM SRAM.  This SRAM is different
 * because it cannot be used for DMA.  So if DMA needed, then the following
 * should be defined to exclude CCM SRAM from the heap:
 *
 * CONFIG_STM32_CCMEXCLUDE    : Exclude CCM SRAM from the HEAP
 *
 * In addition to internal SRAM, external RAM may also be available through
 * the FMC/FSMC. To use external RAM, the following things need to be present
 * in the NuttX configuration file:
 *
 * CONFIG_STM32_FSMC=y         : Enables the FSMC
 * CONFIG_STM32_FMC=y          : Enables the FMC
 * CONFIG_STM32_EXTERNAL_RAM=y : Indicates external RAM is available via the
 *                               FMC/FSMC (as opposed to an LCD or FLASH).
 * CONFIG_HEAP2_BASE           : The base address of the external RAM
 * CONFIG_HEAP2_SIZE           : The size of the external RAM
 * CONFIG_MM_REGIONS           : Must be set to a large enough value to
 *                               include the external RAM (as determined by
 *                               the rules provided below)
 */

#if !defined(CONFIG_STM32_FSMC) && !defined(CONFIG_STM32_FMC)
#  undef CONFIG_STM32_EXTERNAL_RAM
#endif

/* The STM32L15xxx family has only internal SRAM.  The heap is in one
 * contiguous block starting at g_idle_topstack and extending through
 * CONFIG_RAM_END.
 */

#if defined(CONFIG_STM32_STM32L15XX)

/* Set the end of system SRAM */

#  define SRAM1_END CONFIG_RAM_END

/* There is no FSMC (Other EnergyLite STM32's do have an FSMC, but not
 * the STM32L15X
 */

#  undef CONFIG_STM32_EXTERNAL_RAM

/* The STM32L EnergyLite family has no CCM SRAM */

#  undef CONFIG_STM32_CCMEXCLUDE
#  define CONFIG_STM32_CCMEXCLUDE 1

/* Only one memory region can be support (internal SRAM) */

#  if CONFIG_MM_REGIONS > 1
#    error "CONFIG_MM_REGIONS > 1.  The STM32L15X has only one memory region."
#  endif

/* For the STM312F10xxx family, all internal SRAM is in one contiguous
 * block starting at g_idle_topstack and extending through CONFIG_RAM_END
 * (my apologies for the bad naming).  In addition, external FSMC SRAM
 * may be available.
 */

#elif defined(CONFIG_STM32_STM32F10XX)

/* Set the end of system SRAM */

#  define SRAM1_END CONFIG_RAM_END

/* Check if external FSMC SRAM is provided */

#  ifdef CONFIG_STM32_EXTERNAL_RAM
#    if CONFIG_MM_REGIONS < 2
#      warning "FSMC SRAM not included in the heap"
#      undef CONFIG_STM32_EXTERNAL_RAM
#    elif CONFIG_MM_REGIONS > 2
#      error "CONFIG_MM_REGIONS > 2 but I don't know what some of the region(s) are"
#      undef CONFIG_MM_REGIONS
#      define CONFIG_MM_REGIONS 2
#    endif
#  elif CONFIG_MM_REGIONS > 1
#    error "CONFIG_MM_REGIONS > 1 but I don't know what the other region(s) are"
#  endif

/* The STM32 F1 has no CCM SRAM */

#  undef CONFIG_STM32_CCMEXCLUDE
#  define CONFIG_STM32_CCMEXCLUDE 1

/* Members of the STM32F30xxx family has a variable amount of SRAM from 24
 * to 40Kb plus 8KB if CCM SRAM.  No external RAM is supported (the F3 family
 * has no FSMC).
 *
 * As a complication, CCM SRAM cannot be used for DMA.  So, if STM32 DMA is
 * enabled, CCM SRAM should probably be excluded from the heap.
 */

#elif defined(CONFIG_STM32_STM32F30XX)

/* Set the end of system SRAM */

#  define SRAM1_END CONFIG_RAM_END

/* Set the range of CCM SRAM as well (although we may not use it) */

#  define SRAM2_START 0x10000000
#  define SRAM2_END   0x10002000

/* There is no FSMC */

#  undef CONFIG_STM32_EXTERNAL_RAM

/* There are 2 possible SRAM configurations:
 *
 * Configuration 1. System SRAM (only)
 *                  CONFIG_MM_REGIONS == 1
 *                  CONFIG_STM32_CCMEXCLUDE defined
 * Configuration 2. System SRAM and CCM SRAM
 *                  CONFIG_MM_REGIONS == 2
 *                  CONFIG_STM32_CCMEXCLUDE NOT defined
 */

#  if CONFIG_MM_REGIONS < 2

/* Only one memory region.  Force Configuration 1 */

#    ifndef CONFIG_STM32_CCMEXCLUDE
#      ifdef CONFIG_STM32_HAVE_CCM
#        warning "CCM SRAM excluded from the heap"
#      endif
#      define CONFIG_STM32_CCMEXCLUDE 1
#    endif

/* CONFIG_MM_REGIONS may be 2 if CCM SRAM is included in the head */

#  elif CONFIG_MM_REGIONS >= 2
#    if CONFIG_MM_REGIONS > 2
#       error "No more than two memory regions can be supported (CONFIG_MM_REGIONS)"
#       undef CONFIG_MM_REGIONS
#       define CONFIG_MM_REGIONS 2
#    endif

/* Two memory regions is okay if CCM SRAM is not disabled. */

