apache/nuttx/arch/arm/src/common/stm32/stm32_allocateheap_m3m4_v1.c
#    ifdef CONFIG_STM32_CCMEXCLUDE

/* Configuration 1: CONFIG_MM_REGIONS should have been 2 */

#      error "CONFIG_MM_REGIONS >= 2 but but CCM SRAM is excluded (CONFIG_STM32_CCMEXCLUDE)"
#      undef CONFIG_MM_REGIONS
#      define CONFIG_MM_REGIONS 1
#    else

/* Configuration 2: DMA should be disabled */

#      ifdef CONFIG_ARCH_DMA
#        warning "CCM SRAM is included in the heap AND DMA is enabled"
#      endif
#    endif
#  endif

/* All members of the STM32F33xxx families have 16 Kbi ram and 4 KB CCM SRAM.
 * No external RAM is supported (the F3 family has no FSMC).
 *
 * As a complication, CCM SRAM cannot be used for DMA.  So, if STM32 DMA is
 * enabled, CCM SRAM should probably be excluded from the heap.
 */
#elif defined(CONFIG_STM32_STM32F33XX)

/* Set the end of system SRAM */

#  define SRAM1_END CONFIG_RAM_END

/* Set the range of CCM SRAM as well (although we may not use it) */

#  define SRAM2_START 0x10000000
#  define SRAM2_END   0x10001000

/* There is no FSMC */

#  undef CONFIG_STM32_EXTERNAL_RAM

/* There are 2 possible SRAM configurations:
 *
 * Configuration 1. System SRAM (only)
 *                  CONFIG_MM_REGIONS == 1
 *                  CONFIG_STM32_CCMEXCLUDE defined
 * Configuration 2. System SRAM and CCM SRAM
 *                  CONFIG_MM_REGIONS == 2
 *                  CONFIG_STM32_CCMEXCLUDE NOT defined
 */

#  if CONFIG_MM_REGIONS < 2

/* Only one memory region.  Force Configuration 1 */

#    ifndef CONFIG_STM32_CCMEXCLUDE
#      ifdef CONFIG_STM32_HAVE_CCM
#        warning "CCM SRAM excluded from the heap"
#      endif
#      define CONFIG_STM32_CCMEXCLUDE 1
#    endif

/* CONFIG_MM_REGIONS may be 2 if CCM SRAM is included in the head */

#  elif CONFIG_MM_REGIONS >= 2
#    if CONFIG_MM_REGIONS > 2
#      error "No more than two memory regions can be supported (CONFIG_MM_REGIONS)"
#      undef CONFIG_MM_REGIONS
#      define CONFIG_MM_REGIONS 2
#    endif

/* Two memory regions is okay if CCM SRAM is not disabled. */

#    ifdef CONFIG_STM32_CCMEXCLUDE

/* Configuration 1: CONFIG_MM_REGIONS should have been 2 */

#      error "CONFIG_MM_REGIONS >= 2 but but CCM SRAM is excluded (CONFIG_STM32_CCMEXCLUDE)"
#      undef CONFIG_MM_REGIONS
#      define CONFIG_MM_REGIONS 1
#    else

/* Configuration 2: DMA should be disabled */

#      ifdef CONFIG_ARCH_DMA
#        warning "CCM SRAM is included in the heap AND DMA is enabled"
#      endif
#    endif
#  endif

/* All members of the STM32F37xxx families have 16-32 Kib ram in a single
 * bank. No external RAM is supported (the F3 family has no FSMC).
 */
#elif defined(CONFIG_STM32_STM32F37XX)

/* Set the end of system SRAM */

#  define SRAM1_END CONFIG_RAM_END

/* There is no FSMC */

#  undef CONFIG_STM32_EXTERNAL_RAM

/* The STM32 F37xx has no CCM SRAM */

#  undef CONFIG_STM32_CCMEXCLUDE
#  define CONFIG_STM32_CCMEXCLUDE 1

/* Only one memory region can be support (internal SRAM) */

#  if CONFIG_MM_REGIONS > 1
#    error "CONFIG_MM_REGIONS > 1.  The STM32L15X has only one memory region."
#  endif

/* Most members of both the STM32F20xxx and STM32F40xxx families have 128Kib
 * in two banks:
 *
 *   1) 112KiB of System SRAM beginning at address 0x2000:0000
 *   2)  16KiB of System SRAM beginning at address 0x2001:c000
 *
 * The STM32F401 family is an exception and has only 64KiB or 96Kib total
 * on one bank:
 *
 *   3) 64KiB (STM32F401xB/C) or 96KiB (STM32401xD/E) of System SRAM
 *      beginning at address 0x2000:0000
 *
 * Members of the STM32F40xxx family have an additional 64Kib of CCM RAM
 * for a total of 192KB.
 *
 *   4) 64Kib of CCM SRAM beginning at address 0x1000:0000
 *
 * The STM32F427/437/429/439 parts have another 64KiB of System SRAM for
 * a total of 256KiB.
 *
 *   5) 64Kib of System SRAM beginning at address 0x2002:0000
 *
 * The STM32F412 family has 256KiB of System SRAM in one bank and no CCM:
 *
 *   6) 256KiB of System SRAM beginning at address 0x2000:0000
 *
 * As determined by the linker script, g_heapbase lies in the 112KiB memory
 * region and that extends to 0x2001:0000.  But the  first and second memory
 * regions are contiguous and treated as one in this logic that extends to
 * 0x2002:0000 (or 0x2003:0000 for the F427/F437/F429/F439, or 0x2004:0000
 * for the F412).
 *
 * As a complication, CCM SRAM cannot be used for DMA.  So, if STM32 DMA is
 * enabled, CCM SRAM should probably be excluded from the heap or the
 * application must take extra care to ensure that DMA buffers are not
 * allocated in CCM SRAM.
 *
 * In addition, external FSMC SRAM may be available.
 */

#elif defined(CONFIG_STM32_HAVE_IP_FLASH_M3M4_F2F4)

/* The STM32 F2 and the STM32 F401/F411/F412 have no CCM SRAM */

#  if defined(CONFIG_STM32_STM32F20XX) || defined(CONFIG_STM32_STM32F401) || \
      defined(CONFIG_STM32_STM32F411) || defined(CONFIG_STM32_STM32F410) || \
      defined(CONFIG_STM32_STM32F412)
#    undef CONFIG_STM32_CCMEXCLUDE
#    define CONFIG_STM32_CCMEXCLUDE 1
#  endif

/* Set the end of system SRAM */

#  if defined(CONFIG_STM32_STM32F401xBC)
#    define SRAM1_END 0x20010000
#  elif defined(CONFIG_STM32_STM32F401xDE)
#    define SRAM1_END 0x20018000
#  elif defined(CONFIG_STM32_STM32F410)
#    define SRAM1_END 0x20008000
#  elif defined(CONFIG_STM32_STM32F427) || defined(CONFIG_STM32_STM32F429)
#    define SRAM1_END 0x20030000
#  elif defined(CONFIG_STM32_STM32F412)
#    define SRAM1_END 0x20040000
#  elif defined(CONFIG_STM32_STM32F446)
#    define SRAM1_END 0x20020000
#  elif defined(CONFIG_STM32_STM32F469)
#    define SRAM1_END 0x20050000
#  else
#    define SRAM1_END 0x20020000
#  endif

/* Set the range of CCM SRAM as well (although we may not use it) */

#  define SRAM2_START 0x10000000
#  define SRAM2_END   0x10010000

/* There are 4 possible SRAM configurations:
 *
 * Configuration 1. System SRAM (only)
 *                  CONFIG_MM_REGIONS == 1
 *                  CONFIG_STM32_EXTERNAL_RAM NOT defined
 *                  CONFIG_STM32_CCMEXCLUDE defined
 * Configuration 2. System SRAM and CCM SRAM
 *                  CONFIG_MM_REGIONS == 2
 *                  CONFIG_STM32_EXTERNAL_RAM NOT defined
 *                  CONFIG_STM32_CCMEXCLUDE NOT defined
 * Configuration 3. System SRAM and FSMC SRAM
 *                  CONFIG_MM_REGIONS == 2
 *                  CONFIG_STM32_EXTERNAL_RAM defined
 *                  CONFIG_STM32_CCMEXCLUDE defined
 * Configuration 4. System SRAM, CCM SRAM, and FSMC SRAM
 *                  CONFIG_MM_REGIONS == 3
 *                  CONFIG_STM32_EXTERNAL_RAM defined
 *                  CONFIG_STM32_CCMEXCLUDE NOT defined
 *
 * Let's make sure that all definitions are consistent before doing
 * anything else
 */

