apache/nuttx/arch/arm/src/common/stm32/stm32_allocateheap_m3m4_v1.c
#  if defined(CONFIG_STM32_EXTERNAL_RAM)

/* Configuration 3 or 4. External SRAM is available.  CONFIG_MM_REGIONS
 * should be at least 2.
 */

#    if CONFIG_MM_REGIONS < 2

/* Only one memory region.  Force Configuration 1 */

#      warning "FSMC SRAM (and CCM SRAM) excluded from the heap"
#      undef CONFIG_STM32_EXTERNAL_RAM
#      undef CONFIG_STM32_CCMEXCLUDE
#      define CONFIG_STM32_CCMEXCLUDE 1

/* CONFIG_MM_REGIONS may be 3 if CCM SRAM is included in the head */

#    elif CONFIG_MM_REGIONS > 2

/* More than two memory regions.  This is okay if CCM SRAM is not
 * disabled.
 */

#      if defined(CONFIG_STM32_CCMEXCLUDE)

/* Configuration 3: CONFIG_MM_REGIONS should have been 2 */

#        error "CONFIG_MM_REGIONS > 2 but I don't know what some of the region(s) are"
#        undef CONFIG_MM_REGIONS
#        define CONFIG_MM_REGIONS 2
#      else

/* Configuration 4: DMA should be disabled and CONFIG_MM_REGIONS
 * should be 3.
 */

#        ifdef CONFIG_ARCH_DMA
#          warning "CCM SRAM is included in the heap AND DMA is enabled"
#        endif

#        if CONFIG_MM_REGIONS != 3
#          error "CONFIG_MM_REGIONS > 3 but I don't know what some of the region(s) are"
#          undef CONFIG_MM_REGIONS
#          define CONFIG_MM_REGIONS 3
#        endif
#      endif

/* CONFIG_MM_REGIONS is exactly 2.  We cannot support both CCM SRAM and
 * FSMC SRAM.
 */

#    elif !defined(CONFIG_STM32_CCMEXCLUDE)
#      error "CONFIG_MM_REGIONS == 2, cannot support both CCM SRAM and FSMC SRAM"
#      undef CONFIG_STM32_CCMEXCLUDE
#      define CONFIG_STM32_CCMEXCLUDE 1
#    endif

#  elif !defined(CONFIG_STM32_CCMEXCLUDE)

/* Configuration 2: FSMC SRAM is not used, but CCM SRAM is requested.
 * DMA should be disabled and CONFIG_MM_REGIONS should be 2.
 */

#    ifdef CONFIG_ARCH_DMA
#      warning "CCM SRAM is included in the heap AND DMA is enabled"
#    endif

#    if CONFIG_MM_REGIONS < 2
#      ifdef CONFIG_STM32_HAVE_CCM
#        warning "CCM SRAM excluded from the heap because CONFIG_MM_REGIONS < 2"
#      endif
#      undef CONFIG_STM32_CCMEXCLUDE
#      define CONFIG_STM32_CCMEXCLUDE 1
#    elif CONFIG_MM_REGIONS > 2
#      error "CONFIG_MM_REGIONS > 2 but I don't know what some of the region(s) are"
#      undef CONFIG_MM_REGIONS
#      define CONFIG_MM_REGIONS 2
#    endif
#  endif

/* STM32G47xxx family P/Ns have 96KiB of internal RAM in 2 banks, plus 32 KiB
 * of CCM SRAM (Routine Booster), and the possibility of external RAM via
 * FSMC:
 *
 * All internal RAM is contiguous from address 0x2000:0000 thru 0x2001:FFFF,
 * but consists of these separate regions:
 *
 * SRAM:
 *
 * 1) 80 KiB SRAM1 mapped at 0x2000:0000 thru 0x2001:3FFF.
 * 2) 16 KiB SRAM2 mapped at 0x2001:4000 thru 0x2001:7FFF.
 *
 * CCM SRAM:
 *
 * 3) 32 KiB CCM SRAM mapped at 0x1000:0000 thru 0x1000:7FFF
 *    but also aliased at at 0x2001:8000 thru 0x2001:FFFF to be contiguous
 *    with the SRAM1 and SRAM2.
 *
 * Because SRAM1 and SRAM2 are contiguous, they are treated as one region
 * by this logic.
 *
 * REVISIT: I believe that unlike other parts mentioned in this file, the
 * CCM SRAM *is* accessible to DMA. See Reference Manual (RM0440 Rev 2)
 * section 2.1.3, DMA-Bus: "This bus connects the AHB master interface of
 * the DMA to the BusMatrix. The targets of this bus are the SRAM1, SRAM2
 * and CCM SRAM..." Then, should we exclude CCM SRAM from the heap?
 *
 * In addition, external FSMC SRAM may be available.
 */

#elif defined(CONFIG_STM32_STM32G4XXX)

/* Set the end of system SRAM */

#if defined(CONFIG_STM32_STM32G47XX)
#  define SRAM1_END                    0x20020000
#elif defined(CONFIG_STM32_STM32G43XX)
#  define SRAM1_END                    0x20005800
#else
#  error "Unsupported STM32G4 chip"
#endif

/* Set the range of CCM SRAM as well (although we may not use it) */

#  define SRAM2_START                  0x10000000

#if defined(CONFIG_STM32_STM32G47XX)
#    define SRAM2_END                  0x10008000
#elif defined(CONFIG_STM32_STM32G43XX)
#    define SRAM2_END                  0x10002700
#else
#  error "Unsupported STM32G4 chip"
#endif

/* There are 4 possible SRAM configurations:
 *
 * Configuration 1. System SRAM (only)
 *                  CONFIG_MM_REGIONS == 1
 *                  CONFIG_STM32_EXTERNAL_RAM NOT defined
 *                  CONFIG_STM32_CCMEXCLUDE defined
 * Configuration 2. System SRAM and CCM SRAM
 *                  CONFIG_MM_REGIONS == 2
 *                  CONFIG_STM32_EXTERNAL_RAM NOT defined
 *                  CONFIG_STM32_CCMEXCLUDE NOT defined
 * Configuration 3. System SRAM and FSMC SRAM
 *                  CONFIG_MM_REGIONS == 2
 *                  CONFIG_STM32_EXTERNAL_RAM defined
 *                  CONFIG_STM32_CCMEXCLUDE defined
 * Configuration 4. System SRAM, CCM SRAM, and FSMC SRAM
 *                  CONFIG_MM_REGIONS == 3
 *                  CONFIG_STM32_EXTERNAL_RAM defined
 *                  CONFIG_STM32_CCMEXCLUDE NOT defined
 *
 * Let's make sure that all definitions are consistent before doing
 * anything else
 */

#  if defined(CONFIG_STM32_EXTERNAL_RAM)
#    if (CONFIG_MM_REGIONS == 2)
/* OK: This is Configuration 3: SRAM and FSMC */

#    elif (CONFIG_MM_REGIONS == 3)
/* OK: This is Configuration 3: SRAM, CCM, and FSMC */

#    else
#      error "Expected CONFIG_MM_REGIONS to be either 2 (SRAM + FSMC) or 3 (SRAM + CCM + FSMC)!"

#    endif
#  else
#    if (CONFIG_MM_REGIONS == 1)
/* OK: Configuration 1: SRAM only. */

#    elif (CONFIG_MM_REGIONS == 2)
/* OK: Configuration 2: SRAM and CCM SRAM. */

#    else
#      error "Expected CONFIG_MM_REGIONS to be either 1 (SRAM) or 2 (SRAM + CCM)!"

#    endif
#  endif

#else
#  error "Unsupported STM32 chip"
#endif

/* If FSMC SRAM is going to be used as heap, then verify that the starting
 * address and size of the external SRAM region has been provided in the
 * configuration (as CONFIG_HEAP2_BASE and CONFIG_HEAP2_SIZE).
 */

#ifdef CONFIG_STM32_EXTERNAL_RAM
#  if !defined(CONFIG_HEAP2_BASE) || !defined(CONFIG_HEAP2_SIZE)
#    error "CONFIG_HEAP2_BASE and CONFIG_HEAP2_SIZE must be provided"
#    undef CONFIG_STM32_EXTERNAL_RAM
#  endif
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_heap_color
 *
 * Description:
 *   Set heap memory to a known, non-zero state to checking heap usage.
 *
 ****************************************************************************/

#ifdef CONFIG_HEAP_COLORATION
static inline void up_heap_color(void *start, size_t size)
{
  memset(start, HEAP_COLOR, size);
}
#else
#  define up_heap_color(start,size)
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_allocate_heap
 *
 * Description:
 *   This function will be called to dynamically set aside the heap region.
 *
 *   For the kernel build (CONFIG_BUILD_PROTECTED=y) with both kernel- and
 *   user-space heaps (CONFIG_MM_KERNEL_HEAP=y), this function provides the
 *   size of the unprotected, user-space heap.
 *
 *   If a protected kernel-space heap is provided, the kernel heap must be
 *   allocated (and protected) by an analogous up_allocate_kheap().
 *
 *   The following memory map is assumed for the flat build:
 *
 *     .data region.  Size determined at link time.
 *     .bss  region  Size determined at link time.
 *     IDLE thread stack.  Size determined by CONFIG_IDLETHREAD_STACKSIZE.
 *     Heap.  Extends to the end of SRAM.
 *
 *   The following memory map is assumed for the kernel build:
 *
 *     Kernel .data region       Size determined at link time
 *     Kernel .bss  region       Size determined at link time
 *     Kernel IDLE thread stack  Size determined by
 *                                CONFIG_IDLETHREAD_STACKSIZE
 *     Padding for alignment
 *     User .data region         Size determined at link time
 *     User .bss region          Size determined at link time
 *     Kernel heap               Size determined by
 *                                CONFIG_MM_KERNEL_HEAPSIZE
 *     User heap                 Extends to the end of SRAM
 *
 ****************************************************************************/

